function Contacts() {
    return(
        <div>
            <h1>Теоретическая часть</h1>
            <div><img src="https://i.pinimg.com/originals/1b/ff/1e/1bff1ea051dccf2d01c0154e67e9c0d7.gif" width="250" height="250"/></div>
            <h3>1.1	Логическое мышление</h3>
            <p>Психологи по-разному определяют понятие "мышление":</p>
            <p><b><i>Мышление</i></b>— это социально-обусловленный, неразрывно связанный с речью психический процесс поисков и открытий существенно нового, процесс опосредованного и обобщенного отражения действительности в ходе ее анализа и синтеза. Мышление возникает на основе практической деятельности из чувственного познания и далеко выходит за его пределы.
            <b> (А.В. Петровский)</b></p>
            <p><b><i>Мышление</i></b>— это психический процесс познания, связанный с открытием субъективно нового знания, с решением задач, с творческим преобразованием действительности.
            <b> (Р.С. Немов)</b></p>

    <p>Мышление позволяет человеку находить связи между феноменами действительности, но, чтобы найденные связи, действительно, отражали истинное положение дел, мышление должно быть объективным, правильным или, другими словами, логичным, то есть подчиненным законам логики.</p>
    <p><b><i>Логика</i></b> в переводе с греческого имеет несколько значений: «наука о правильном мышлении», «искусство рассуждения», «речь», «рассуждение» и даже «мысль». Логика изучает способы достижения истины в процессе познания опосредованным путём, не из чувственного опыта, а из знаний, полученных ранее, поэтому её также можно определить как науку о способах получения выводного знания. </p>
    <p>Теперь мы можем дать определение самому логическому мышлению.</p>
    <p><b><i>Логическое мышление</i></b> – это мыслительный процесс, при котором человек использует логические понятия и конструкции, которому свойственна доказательность, рассудительность, и целью которого является получение обоснованного вывода из имеющихся предпосылок.</p>
    <p>Мыслительные процессы подразделяются на следующие разновидности:</p>
    <p><b><i>Сравнение</i></b>  – выявление общих и отличительных характеристик предметов и явлений.</p>
    <p><b><i>Абстракция</i></b> – умственная деятельность, позволяющая обособить те или иные свойства предмета от других. Отделить главное от второстепенного, абстрагироваться, сделать выводы.</p>
    <p><b><i>Обобщение</i></b>  – объединение схожих признаков, явлений. Применяется для выявления закономерностей.</p>
    <p><b><i>Анализ</i></b> – мыслительный процесс, разделяющий предмет или рассматриваемое явление на части.</p>
    <p><b><i>Синтез</i></b>  – воссоединение отдельных элементов в целое. Логическая операция, напоминающее составление пазлов.</p>
    <p><b><i>Зачем нужно логическое мышление?</i></b> </p>
    <p>Логика помогает отделять главное от второстепенного, улавливать закономерности, обосновывать явления, доказывать факты, выстраивать суждения. Логический подход позволяет решать различные задачи, начиная от простейших бытовых (какой дорогой быстрее дойти до офиса), заканчивая масштабными проектами.</p>
    <div><img src="https://i.gifer.com/XoD7.gif" width="350" height="350"/></div>
    <p><b><i>Применение логики</i></b> обширно. Эта наука затрагивает любую область человеческих знаний: экономику, информатику, математику, творчество, философию, гуманитарные науки, риторику. Форма мышления является источником знаний, которая позволяет делать определенные выводы.</p>
    <p>Малая часть применения логики:</p>
    <ul>
        <li>понятное изложение собственных мыслей;</li>
        <li>возможность аргументировано склонить собеседника на свою сторону;</li>
        <li>поиск решения проблем;</li>
        <li>доказывание истины;</li>
        <li>опровержение лживой информации;</li>
        <li>поиск и коррекция ошибок.</li>
    </ul>
    <p>Также нельзя забывать про очевидное психологическое достоинство: имея развитое логическое мышление человеку легче преодолевать жизненные препятствия, он более уверен в себе, добивается большего успеха в учёбе и карьере. </p>
    <h3>1.2	 Логика в информатике и ИКТ</h3>
    <div><img src="https://static.wixstatic.com/media/29b303_74c72cc216924d608b51fa0148b72383~mv2.gif" width="350" height="250"/></div>
    <p>Логика как наука была основана Аристотелем, которого считают философом, но никак не математиком и уж точно не информатиком. И логика в начале своего появления была элементом философии, одним из методов рассуждений. В труде «Аналитики» Аристотель создал 20 схем рассуждений, которые назвал силлогизмами. Одним из самых известных его силлогизмов является: «Сократ - человек; все люди смертны; значит, Сократ смертен». </p>
    <p>Так как мы коснулись темы логики, то сразу возникает вопрос: «К чему применима логика в информатике и каковы её задачи?»</p>
    <p>Элементы и основы логики заложены в логические элементы и логические устройства ЭВМ, в основы алгоритмизации и языки программирования, в процедуры поиска информации в базах данных и в сети Интернет, а также в системах логического программирования, базах знаний и экспертных системах на ЭВМ.</p>
    <p><b><i>Логика в информатике</i></b>  – это те отрасли знания и направления исследований, в которых логика применяется в информатике и искусственном интеллекте. В информатике логика оказалась гораздо более эффективной, чем это было в математике.</p>
    <p>Для описания рассуждений и правил выполнения действий с информацией используют специальный язык, принятый в логике. В основе рассуждений содержатся специальные предложения, называемые высказываниями. В высказываниях всегда что-либо утверждается или отрицается об объектах, их свойствах и отношениях между объектами. Высказыванием является любое суждение, относительно которого можно сказать, истинно оно или ложно. Высказываниями могут быть только повествовательные предложения. Вопросительные или побудительные предложения высказываниями не являются.</p>
    <h3>1.2.1 Логические задачи</h3>
    <p><b><i>Логическая задача</i></b> — это головоломка, которая не требует арифметических выкладок и вычислений, для ее решения необходимо лишь умение грамотно логически мыслить и рассуждать. Половина решения любой логической задачи (а иногда и гораздо больше половины) состоит в том, чтобы как следует разобраться в условии, распутать все связи между участвующими объектами.</p>
    <p>Чтобы правильно рассуждать, надо изучить правильные способы и методы рассуждении. Научится правильно составлять высказывания, или, как говориться в логике, выполнять операции над высказываниями. </p>
    <p><b>Типы логических задач</b></p>
    <p>Нечисловые задачи очень разнообразны по сложности, содержанию и способам решения. Логические задачи составляют обширный класс нестандартных задач. Сюда относятся, прежде всего, текстовые задачи, в которых требуется распознать объекты или расположить их в определенном порядке по имеющимся свойствам. При этом часть утверждений условия задачи может выступать с различной истинностной оценкой (быть истинной или ложной).</p>
    <p><i>Все логические задачи делятся на определенные группы (типы):</i></p>
    <ul>
        <li>Истинноностные задачи</li>
        <li>Задачи, решаемые с конца </li>
        <li>Задачи на взвешивание</li>
        <li>Задачи типа «Кто есть кто?»</li>
        <li>Задачи на пересечение и объединение множеств</li>
    </ul>
    <p><b>Методы решения логических задач</b></p>
    <p>При решении определенного типа задач существует свой оптимальный метод решения:</p>
    <p>1. Истинноностные задачи: при решении задач данного типа лучше всего использовать M<b><i>метод рассуждений</i></b>. Он позволяет проводить рассуждения, используя последовательно все условия задачи, и приходить к выводу, который и будет являться ответом задачи.</p>
    <p>Задачи на взвешивание: в таких задачах от решающего требуется локализовать отличающийся от остальных предмет по весу за ограниченное число взвешиваний. Поиск решения в этом случае осуществляется путем операций сравнения, правда, не только одиночных элементов, но и групп элементов между собой. Задачи данного типа чаще всего решаются <i><b>метод рассуждений</b></i>.</p>
    <p>2. Задачи на пересечение и объединение множеств: это тип задач, в которых требуется найти некоторое пересечение множеств или их объединение, соблюдая условия задачи. <b><i>Метод Эйлера</i></b> является незаменимым при решении задач этого типа, а также упрощает рассуждения. Однако, прежде чем приступить к решению задачи, нужно проанализировать условие.</p>
    <p>3. Задачи на переливание и Задачи типа «Кто есть кто?»: при решении текстовых логических задач на переливание применяется<b> <i>метод построения таблиц</i></b>. Таблицы не только позволяют наглядно представить условие задачи или ее ответ, но в значительной степени помогают делать правильные логические выводы в ходе решения задачи. Задачи данного типа еще можно решать<i><b> методом графов</b></i></p>
    <p>4. Задачи, решаемые с конца: такие задачи очень часто ребята задают друг другу в виде головоломок на задуманное число. Задачи решаются<b> <i>методом математических вычислений</i></b>, основанных на конечном результате в условии.</p>

</div>
    )
}
export default Contacts;