function News()
{
    return(
    <div>
        <p>Информационные технологии, предъявляющие высокие требования к интеллекту работников, занимают лидирующее положение на рынке труда. Но, если навыки работы с конкретным техническим устройством можно приобрести непосредственно на рабочем месте, то логическое мышление, не развитое в определенном возрасте, таковым и останется.</p>
            <p><b>Необходимость изучения данной темы</b> обусловлена потребностью развития информационных и коммуникационных технологий (ИКТ), в системе непрерывного образования в условиях информатизации, глобализации и массовой коммуникации современного общества. На данном этапе развития общества деятельность человека в техническом плане очень быстро и резко меняется, одни технологии заменяются новшествами, требующими другого подхода, новых знаний, навыков, умений, которые необходимо осваивать иными методами.  </p>
            <div><img src="https://static.wixstatic.com/media/a95475_04f29967f6e84f9fa45907ac4f6e2a22~mv2.gif" width="250" height="350"/></div>
            <p>Таким образом, выделяется<b> социально значимая проблема</b>: для подготовки детей к жизни в современном информационном обществе в первую очередь необходимо развивать логическое мышление, способность к анализу (вычленению структуры объекта, выявлению взаимосвязей, осознанию принципов организации) и синтезу (созданию новых схем, структур и моделей). </p>
            <p>Также в 21 веке, в веке информационных технологий, умственная деятельность многих подростков становится менее активной. Большинство подрастающего поколения уже не могут вычислять без калькуляторов, нестандартно мыслить, а прибегают к помощи Интернета. Своевременное развитие мыслительных навыков поможет школьникам в дальнейшем без трудностей пройти все этапы взросления и обучения более сложным аспектам современной жизни. Для решения данной проблемы необходим системный и добросовестный подход педагога к укреплению и улучшению условий для развития логического мышления учащихся в первую очередь на уроках математики и информатики.   </p>
            <p>В практике работы общеобразовательного учреждения ещё не накоплен материал, необходимый для анализа существенных характеристик логического мышления учащихся, условий и механизмов его развития в процессе изучения курса информатики и информационных технологий. Возникает противоречие между назревшими проблемами в наличии логического мышления учащихся, реализации обучения самого курса информатики и ИКТ и отсутствием условий, средств и механизмов интенсификации мыслительных процессов учащихся в процессе изучения данного предмета. Поэтому развитие логического мышления на уроках информатики актуально.</p>
            <h3>Актуальность данной темы определяется:</h3>
            <ul>
                <li>социальным заказом общества личность учащегося, выпускника школы, обладающего логическим мышлением, способного осваивать, преобразовывать свою учебную, трудовую деятельность и предлагать новые идеи;</li>

                    <li> важностью создания психолого-педагогических условий и средств, способствующих развитию логического мышления учащихся;</li>

                    <li>потребностью в разработке и усовершенствовании педагогической системы обучения информатике учащихся в общеобразовательном учреждении с целью своевременного развития логического мышления школьников.</li>
            </ul>
        </div>
    )
}
export default News;